Tutorials/tutorial9/app/controllers/posts_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 10 LIMIT 1
INSERT INTO `posts` (`title`, `description`, `public_flag`, `user_id`, `created_at`, `updated_at`) VALUES ('Hello Sir', 'From NewYork', TRUE, 10, '2021-12-28 18:02:33.458055', '2021-12-28 18:02:33.458055')
---
  def create
    @user = User.find(params[:user_id])
    @post = @user.posts.create(post_params)

SELECT `users`.* FROM `users` WHERE `users`.`id` = 10 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 9 LIMIT 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 10 AND `posts`.`id` = 12 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 12
---
  def destroy
    @user = User.find(params[:user_id])
    @post = @user.posts.find(params[:id])
    @post.destroy

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 12 LIMIT 1
---
    def set_post
      @post = Post.find(params[:id])