Tutorials/tutorial9/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `email`, `password`, `super_user_flag`, `phone`, `address`, `birthday`, `created_at`, `updated_at`) VALUES ('Jin Xin', 'jinxin@gmail.com', 'jinxin', TRUE, '09761427431', 'Yangon', '1992-10-06', '2021-12-28 07:51:58.627971', '2021-12-28 07:51:58.627971')

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `users`.`address` = 'Yangon/MhawBi', `users`.`updated_at` = '2021-12-28 16:37:12.950660' WHERE `users`.`id` = 1