ruby_on_rails/assignment2/app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE (name LIKE '%%' AND email LIKE '%%' AND phone LIKE '%%' AND address LIKE '%%' AND birthday LIKE '%%' AND super_user_flag LIKE '%%')
---
  def index
    @name = params[:name]
    @email = params[:email]
    @phone = params[:phone]
    @address = params[:address]
    @birthday = params[:birthday]
    @super_user_flag = params[:super_user_flag]
    if @users = User.where("name LIKE ? AND email LIKE ? AND phone LIKE ? AND address LIKE ? AND birthday LIKE ? AND super_user_flag LIKE ?", "%#{@name}%", "%#{@email}%", "%#{@phone}%", "%#{@address}%", "%#{@birthday}%", "%#{@super_user_flag}%")