ruby_on_rails/asgn3/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      @post.save
---
INSERT INTO `posts` (`title`, `description`, `privacy`, `created_at`, `updated_at`) VALUES ('hi', 'new create', NULL, '2022-01-09 20:02:15.352043', '2022-01-09 20:02:15.352043')

  def destroy
    @post.destroy
---
DELETE FROM `posts` WHERE `posts`.`id` = 1

  def set_post
    @post = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1