ruby_on_rails/assignment1/app/repositories/post_repository.rb

INSERT INTO `posts` (`title`, `description`, `public_flag`, `user_id`, `created_at`, `updated_at`) VALUES ('t', 't', TRUE, 9, '2022-01-10 17:13:02.834000', '2022-01-10 17:13:02.834000')
---
    def createPost(user, post)
      @is_save_post = user.posts.create(post)

DELETE FROM `posts` WHERE `posts`.`id` = 94
---
    def destroyPost(post)
      post.destroy