ruby_on_rails/assignment1/app/repositories/user_repository.rb

    def findByEmail(email)
      @user = User.find_by(email: email)
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'jinxin@gmail.com' LIMIT 1

    def createUser(user)
      @is_user_create = user.save
---
INSERT INTO `users` (`name`, `email`, `password_digest`, `super_user_flag`, `phone`, `address`, `birthday`, `created_at`, `updated_at`) VALUES ('Luffy', 'sooya@gmail.com', '$2a$12$Qq3BrlycWgdIP7RMqGWGV.MyVZ4OflOu1cZJYKVRKzJ47quTeel62', TRUE, '123', '123', '1999-12-12', '2022-01-10 18:04:42.301601', '2022-01-10 18:04:42.301601')

    def destroyUser(user)
      user.destroy
---
DELETE FROM `users` WHERE `users`.`id` = 11

    def getUserById(id)
      @user = User.find(id)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 9 LIMIT 1