ruby_on_rails/assignment1/app/controllers/posts_controller.rb

INSERT INTO `posts` (`title`, `description`, `public_flag`, `user_id`, `created_at`, `updated_at`) VALUES ('t', 't', TRUE, 9, '2022-01-10 17:13:02.834000', '2022-01-10 17:13:02.834000')
---
  def create
    @user = UserService.getUserById(session[:user_id])
    @post = PostService.createPost(@user, post_params)

DELETE FROM `posts` WHERE `posts`.`id` = 94
---
  def destroy
    @user = UserService.getUserById(params[:user_id])
    PostService.destroyPost(@post)

SELECT `posts`.* FROM `posts`
---
  def export
    @posts = Post.all

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 94 LIMIT 1
---
  def set_post
    @post = Post.find(params[:id])