ruby_on_rails/assignment1/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @is_user_create = UserService.createUser(@user)
---
INSERT INTO `users` (`name`, `email`, `password_digest`, `super_user_flag`, `phone`, `address`, `birthday`, `created_at`, `updated_at`) VALUES ('Luffy', 'sooya@gmail.com', '$2a$12$Qq3BrlycWgdIP7RMqGWGV.MyVZ4OflOu1cZJYKVRKzJ47quTeel62', TRUE, '123', '123', '1999-12-12', '2022-01-10 18:04:42.301601', '2022-01-10 18:04:42.301601')

  def destroy

    UserService.destroyUser(@user)
---
DELETE FROM `users` WHERE `users`.`id` = 11