Tutorials/SCM_Framework/app/repositories/post_repository.rb

    def createPost(user, post)
      @is_save_post = user.posts.create(post)
---
INSERT INTO `posts` (`title`, `description`, `public_flag`, `user_id`, `created_at`, `updated_at`) VALUES ('the new post', 'is it work?', TRUE, 9, '2022-01-04 17:01:15.547910', '2022-01-04 17:01:15.547910')

    def destroyPost(post)
      post.destroy
---
DELETE FROM `posts` WHERE `posts`.`id` = 11