ruby_on_rails/assignment1/app/models/post.rb

  def self.to_csv
    attribs = %w{title description public_flag }

    CSV.generate(headers: true) do |csv|
      csv << attribs

      all.each do |post|
---
SELECT `posts`.* FROM `posts`