Tutorials/SCM_Framework/app/controllers/posts_controller.rb

  def create

    @user = UserService.getUserById(params[:user_id])
    @post = PostService.createPost(@user, post_params)
---
INSERT INTO `posts` (`title`, `description`, `public_flag`, `user_id`, `created_at`, `updated_at`) VALUES ('Hello ', 'new post', TRUE, 9, '2022-01-04 12:52:14.705771', '2022-01-04 12:52:14.705771')

  def destroy
    @user = UserService.getUserById(params[:user_id])
    PostService.destroyPost(@post)
---
DELETE FROM `posts` WHERE `posts`.`id` = 15

    def set_post
      @post = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 20 LIMIT 1